[
    {
      "id_curso": 1,
      "titulo": "Introdução à Informática",
      "classe": 1,
      "modulos": [
        {
          "nome": "O que é Informática",
          "conteudo": "A informática é a área do conhecimento que trata do uso de computadores e sistemas digitais para coletar, processar, armazenar e distribuir informações. Com o avanço tecnológico, ela se tornou essencial no cotidiano, presente em escolas, empresas, hospitais e no ambiente doméstico."
        },
        {
          "nome": "Hardware e Software",
          "conteudo": "Computadores possuem duas partes principais: hardware e software. O hardware são os componentes físicos, como monitor e teclado. O software é o conjunto de programas que executam tarefas e operam o sistema."
        },
        {
          "nome": "Sistemas Operacionais",
          "conteudo": "O sistema operacional é um software que gerencia os recursos do computador e permite que o usuário interaja com ele. Exemplos incluem Windows, Linux e macOS."
        }
      ]
    },
    {
      "id_curso": 2,
      "titulo": "Noções de Programação em Python",
      "classe": 1,
      "modulos": [
        {
          "nome": "O que é Programação",
          "conteudo": "Programar é criar instruções que o computador executa. Isso permite desenvolver sistemas, sites e jogos, automatizando tarefas e solucionando problemas de forma lógica."
        },
        {
          "nome": "Primeiros Passos com Python",
          "conteudo": "Python é uma linguagem simples, ideal para iniciantes. Um comando básico é print(\"Olá, mundo!\"), que mostra essa mensagem na tela."
        },
        {
          "nome": "Variáveis e Tipos de Dados",
          "conteudo": "Variáveis armazenam valores no programa. Tipos comuns são números inteiros, textos (strings) e booleanos (verdadeiro ou falso)."
        }
      ]
    },
    {
      "id_curso": 3,
      "titulo": "Segurança de Dados e LGPD",
      "classe": 1,
      "modulos": [
        {
          "nome": "Segurança de Dados",
          "conteudo": "É o conjunto de práticas para proteger informações contra acesso indevido, perdas ou ataques. Inclui uso de senhas seguras, backups e antivírus."
        },
        {
          "nome": "O que é LGPD",
          "conteudo": "A LGPD é a Lei Geral de Proteção de Dados. Ela regula como empresas e órgãos públicos devem lidar com informações pessoais dos cidadãos, exigindo transparência e consentimento."
        },
        {
          "nome": "Boas Práticas",
          "conteudo": "Algumas boas práticas incluem usar autenticação em dois fatores, não clicar em links suspeitos, atualizar sistemas e manter antivírus ativado."
        }
      ]
    },
    {
      "id_curso": 4,
      "titulo": "Desenvolvimento Web com HTML e CSS",
      "classe": 2,
      "modulos": [
        {
          "nome": "Introdução ao HTML",
          "conteudo": "HTML é a linguagem padrão para estruturar páginas da web, usando tags como <h1> e <p> para definir elementos como títulos e parágrafos."
        },
        {
          "nome": "Introdução ao CSS",
          "conteudo": "CSS define o estilo visual de uma página, como cores, tamanhos, espaçamentos e fontes. Ele funciona em conjunto com o HTML."
        },
        {
          "nome": "Layout e Responsividade",
          "conteudo": "Layout é como os elementos estão organizados na tela. Responsividade é a capacidade do site se adaptar a diferentes tamanhos de tela."
        }
      ]
    },
    {
      "id_curso": 5,
      "titulo": "Programação Orientada a Objetos em Python",
      "classe": 2,
      "modulos": [
        {
          "nome": "Conceitos de Orientação a Objetos",
          "conteudo": "Na programação orientada a objetos, usamos classes e objetos para organizar dados e comportamentos."
        },
        {
          "nome": "Criando Classes e Objetos",
          "conteudo": "Classes são moldes para objetos. Um objeto é uma instância da classe, com atributos e métodos."
        },
        {
          "nome": "Encapsulamento e Herança",
          "conteudo": "Encapsulamento protege os dados internos de um objeto. Herança permite reutilizar código de uma classe em outra."
        }
      ]
    },
    {
      "id_curso": 6,
      "titulo": "Banco de Dados e SQL",
      "classe": 2,
      "modulos": [
        {
          "nome": "O que é um Banco de Dados",
          "conteudo": "Banco de dados é onde são armazenadas informações de forma organizada, geralmente em tabelas."
        },
        {
          "nome": "Comandos Básicos em SQL",
          "conteudo": "SQL é uma linguagem usada para consultar, inserir, atualizar e deletar dados em bancos de dados."
        },
        {
          "nome": "Relacionamentos e Chaves",
          "conteudo": "Relacionamentos conectam tabelas. Chaves primárias identificam registros e chaves estrangeiras fazem referência entre tabelas."
        }
      ]
    },
    {
      "id_curso": 7,
      "titulo": "Desenvolvimento Web com JavaScript e APIs",
      "classe": 3,
      "modulos": [
        {
          "nome": "Fundamentos do JavaScript",
          "conteudo": "JavaScript é uma linguagem que permite interatividade em sites, como responder a cliques e alterar o conteúdo dinamicamente."
        },
        {
          "nome": "Manipulação do DOM",
          "conteudo": "O DOM representa o HTML como objetos que podem ser manipulados com JavaScript."
        },
        {
          "nome": "Consumo de APIs",
          "conteudo": "APIs permitem que sites busquem dados externos e atualizem conteúdo automaticamente."
        }
      ]
    },
    {
      "id_curso": 8,
      "titulo": "Aplicacoes Seguras e Criptografia",
      "classe": 3,
      "modulos": [
        {
          "nome": "Fundamentos de Segurança Digital",
          "conteudo": "A segurança digital protege sistemas contra invasões e vazamentos, com práticas como senhas fortes e autenticação em dois fatores."
        },
        {
          "nome": "Introdução à Criptografia",
          "conteudo": "Criptografia é o processo de transformar dados para protegê-los contra acessos não autorizados."
        },
        {
          "nome": "Boas Práticas de Segurança",
          "conteudo": "Atualizar sistemas, validar entradas e usar HTTPS ajudam a garantir aplicações seguras."
        }
      ]
    },
    {
      "id_curso": 9,
      "titulo": "Análise de Dados com Python e Pandas",
      "classe": 3,
      "modulos": [
        {
          "nome": "Introdução à Análise de Dados",
          "conteudo": "Analisar dados permite entender padrões, tomar decisões e melhorar estratégias com base em informações."
        },
        {
          "nome": "Estrutura de Dados com Pandas",
          "conteudo": "Pandas oferece estruturas como DataFrames para organizar e manipular dados em Python."
        },
        {
          "nome": "Operações Básicas em Dados",
          "conteudo": "Com Pandas, é possível filtrar, ordenar, agrupar e exportar dados de forma simples."
        }
      ]
    }
]     

